#ifndef _StdHead_H_
#define _StdHead_H_

#define STRICT
//#define UNICODE

#define MPALIBRARY
#include <MPAtrial.h>

/*****************************************************************************/
/*                             ГvГНГgГ^ГCГvТшЛ`                              */
/*****************************************************************************/
/*****************************************************************************/
/*                                 К╓РФТшЛ`                                  */
/*****************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif

/*еееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееее*/
/*                                  ВlВtВk                                   */
/*еееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееееее*/
UDINT_PTR	MPAmulR(UDINT_PTR num, UINT_PTR val);



#ifdef __cplusplus
}
#endif

#endif
